beber007/zottaos/ZottaOS/CORTEX-M3/STM32/ZottaOS_Interrupts.c
#ifdef DEBUG_MODE
/* UndefinedInterrupt: Dummy ISR to fall into an infinite loop when referring to an in-
** existent entry of the interrupt vector table. */
static void UndefinedInterrupt(void)
{
  UINT32 intNum;
  _OSDisableInterrupts();
  intNum  = (*((UINT32 *)0xE000ED04) & 0x1FF);
  intNum  -= 16;
  while (TRUE); // referring to an inexistent entry of the interrupt vector table.
} /* end of undefinedInterrupt */
#endif


/* STM32 specific interrupt vector table, which is added by the linker at the end of table
** CortextM3VectorTable which is defined in ZottaOS_CortexM3.c. */
__attribute__ ((section(".isr_vector_specific")))
void (* const STM32VectorTable[])(void) =
{
  _OSIOHandler, /* OS_IO_WWDG                   0  Window WatchDog */
  _OSIOHandler, /* OS_IO_PVD                    1  PVD through EXTI Line detection */
#if defined(STM32L1XXXX) || defined(STM32F2XXXX) || defined(STM32F4XXXX)
  _OSIOHandler, /* OS_IO_TAMP_STAMP             2  Tamper and TimeStamp through the EXTI
                                                   line*/
  _OSIOHandler, /* OS_IO_RTC_WKUP               3  RTC Wakeup through the EXTI line */
#elif defined(STM32F1XXXX)
  _OSIOHandler, /* OS_IO_TAMPER                 2  Tamper*/
  _OSIOHandler, /* OS_IO_RTC                    3  RTC global */
#else
   #error STM32 version undefined
#endif
  _OSIOHandler, /* OS_IO_FLASH                  4  FLASH global */
  _OSIOHandler, /* OS_IO_RCC                    5  RCC global */
  _OSIOHandler, /* OS_IO_EXTI0                  6  EXTI Line0 */
  _OSIOHandler, /* OS_IO_EXTI1                  7  EXTI Line1 */
  _OSIOHandler, /* OS_IO_EXTI2                  8  EXTI Line2 */
  _OSIOHandler, /* OS_IO_EXTI3                  9  EXTI Line3 */
  _OSIOHandler, /* OS_IO_EXTI4                 10  EXTI Line4 */
#if defined(STM32F2XXXX) || defined(STM32F4XXXX)
  _OSIOHandler, /* OS_IO_DMA1_Stream0          11  DMA1 Stream 0 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream1          12  DMA1 Stream 1 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream2          13  DMA1 Stream 2 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream3          14  DMA1 Stream 3 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream4          15  DMA1 Stream 4 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream5          16  DMA1 Stream 5 global */
  _OSIOHandler, /* OS_IO_DMA1_Stream6          17  DMA1 Stream 6 global */
#elif defined(STM32L1XXXX) || defined(STM32F1XXXX)
  _OSIOHandler, /* OS_IO_DMA1_Channel1         11  DMA1 Channel 1 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel2         12  DMA1 Channel 2 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel3         13  DMA1 Channel 3 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel4         14  DMA1 Channel 4 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel5         15  DMA1 Channel 5 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel6         16  DMA1 Channel 6 global */
  _OSIOHandler, /* OS_IO_DMA1_Channel7         17  DMA1 Channel 7 global */
#else
   #error STM32 version undefined
#endif
/* ------------------------------ STM32L1 --------------------------------------------- */
#if defined(STM32L1XXXX)
  _OSIOHandler, /* OS_IO_ADC1                  18  ADC1 global */
  _OSIOHandler, /* OS_IO_USB_HP                19  USB High Priority */
  _OSIOHandler, /* OS_IO_USB_LP                20  USB Low Priority */
  _OSIOHandler, /* OS_IO_DAC                   21  DAC */
  #if defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_COMP_CA            22  Comparator and Channel acquisition
                                                   through EXTI Line */
  #else
     _OSIOHandler, /* OS_IO_COMP               22  Comparator through EXTI Line  */
  #endif
  _OSIOHandler, /* OS_IO_EXTI9_5               23  External Line[9:5] */
  #if defined(STM32L152X6_X8_XB) || defined(STM32L152XC) || defined(STM32L152XD) || \
      defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_LCD                24  LCD */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if ZOTTAOS_TIMER == OS_IO_TIM9
     _OSTimerHandler, /* OS_IO_TIM9            25  TIM9 global */
  #else
     _OSIOHandler, /* OS_IO_TIM9               25  TIM9 global */
  #endif
  #if ZOTTAOS_TIMER == OS_IO_TIM10
     _OSTimerHandler, /* OS_IO_TIM10           26  TIM10 global */
  #else
     _OSIOHandler, /* OS_IO_TIM10              26  TIM10 global */
  #endif
  #if ZOTTAOS_TIMER == OS_IO_TIM11
     _OSTimerHandler, /* OS_IO_TIM11           27  TIM11 global */
  #else
     _OSIOHandler, /* OS_IO_TIM11              27  TIM11 global */
  #endif
  #if ZOTTAOS_TIMER == OS_IO_TIM2
     _OSTimerHandler, /* OS_IO_TIM2            28  TIM2 global */
  #else
     _OSIOHandler, /* OS_IO_TIM2               28  TIM2 global */
  #endif
  #if ZOTTAOS_TIMER == OS_IO_TIM3
     _OSTimerHandler, /* OS_IO_TIM3            29  TIM3 global */
  #else
     _OSIOHandler, /* OS_IO_TIM3               29  TIM3 global */
  #endif
  #if ZOTTAOS_TIMER == OS_IO_TIM4
     _OSTimerHandler, /* OS_IO_TIM4            30  TIM4 global */
  #else
     _OSIOHandler, /* OS_IO_TIM4               30  TIM4 global */
  #endif
  _OSIOHandler, /* OS_IO_I2C1_EV               31  I2C1 Event */
  _OSIOHandler, /* OS_IO_I2C1_ER               32  I2C1 Error */
  _OSIOHandler, /* OS_IO_I2C2_EV               33  I2C2 Event */
  _OSIOHandler, /* OS_IO_I2C2_ER               34  I2C2 Error */
  _OSIOHandler, /* OS_IO_SPI1                  35  SPI1 global */
  _OSIOHandler, /* OS_IO_SPI2                  36  SPI2 global */
  _OSIOHandler, /* OS_IO_USART1                37  USART1 global */
  _OSIOHandler, /* OS_IO_USART2                38  USART2 global */
  _OSIOHandler, /* OS_IO_USART3                39  USART3 global */
  _OSIOHandler, /* OS_IO_EXTI15_10             40  External Line[15:10]  */
  _OSIOHandler, /* OS_IO_RTC_Alarm             41  RTC Alarm through EXTI Line */
  _OSIOHandler, /* OS_IO_USB_FS_WKUP           42  USB FS WakeUp from suspend through EXTI
                                                   Line */
  _OSIOHandler, /* OS_IO_TIM6                  43  TIM6 global */
  _OSIOHandler, /* OS_IO_TIM7                  44  TIM7 global */
  #if defined(STM32L151XD) || defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_SDIO               45  SDIO global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
     #if ZOTTAOS_TIMER == OS_IO_TIM5
        _OSTimerHandler, /* OS_IO_TIM5         46  TIM5 global */
     #else
        _OSIOHandler, /* OS_IO_TIM5            46  TIM5 global */
     #endif
     _OSIOHandler, /* OS_IO_SPI3               47  SPI3 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
  #endif
  #if defined(STM32L151XD) || defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_UART4              48  UART4 global */
     _OSIOHandler, /* OS_IO_UART5              49  UART5 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
  #endif
  #if defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_DMA2_Channel1      50  DMA2 Channel 1 global */
     _OSIOHandler, /* OS_IO_DMA2_Channel2      51  DMA2 Channel 2 global */
     _OSIOHandler, /* OS_IO_DMA2_Channel3      52  DMA2 Channel 3 global */
     _OSIOHandler, /* OS_IO_DMA2_Channel4      53  DMA2 Channel 4 global */
     _OSIOHandler, /* OS_IO_DMA2_Channel5      54  DMA2 Channel 5 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
     NULL,
     NULL,
     NULL,
  #endif
  #if defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_AES                55  AES global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32L151XC) || defined(STM32L152XC) || defined(STM32L151XD) || \
      defined(STM32L152XD) || defined(STM32L162XD)
     _OSIOHandler, /* OS_IO_COMP_ACQ           56  Comparator Channel Acquisition global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
------------------------------ STM32F1 --------------------------------------------- */
#elif defined(STM32F1XXXX)
  #if defined(STM32F100X4_X6) || defined(STM32F100X8_XB) || \
      defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101X4_X6) || defined(STM32F101T8_TB) || \
      defined(STM32F101C8_CB_R8_RB_V8_VB) || defined(STM32F101RC_RD_RE) || \
      defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || defined(STM32F102X4_X6) || \
      defined(STM32F102X8_XB)
     _OSIOHandler, /* OS_IO_ADC1               18 ADC1 global */
  #elif defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
        defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
        defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F105XX) || \
        defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_ADC1_2             18 ADC1 and ADC2 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_USB_HP_CAN1_TX     19 USB Device High Priority or CAN1 TX */
  #elif defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
     _OSIOHandler, /* OS_IO_USB_HP             19 USB Device High Priority */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_CAN1_TX            19 CAN1 TX */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG)
     _OSIOHandler, /* OS_IO_USB_LP_CAN1_RX0    20 USB Device Low Priority or CAN1 RX0 */
  #elif defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
     _OSIOHandler, /* OS_IO_USB_LP             20 USB Device Low Priority */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_CAN1_RX0           20 CAN1 RX0 */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG) || defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_CAN1_RX1           21 CAN1 RX1 */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG) || defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_CAN1_SCE           22 CAN1 SCE */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_EXTI9_5               23 External Line[9:5] */
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_TIM1_BRK           24 TIM1 Break */
     #if ZOTTAOS_TIMER == OS_IO_TIM1
        _OSTimerHandler_up, /* OS_IO_TIM1_UP  25 TIM1 Update */
     #else
        _OSIOHandler, /* OS_IO_TIM1_UP         25 TIM1 Update */
     #endif
     _OSIOHandler, /* OS_IO_TIM1_TRG_COM       26 TIM1 Trigger and Commutation */
     #if ZOTTAOS_TIMER == OS_IO_TIM1
        _OSTimerHandler_cc, /* OS_IO_TIM1_CC  27 TIM1 Capture Compare */
     #else
        _OSIOHandler, /* OS_IO_TIM1_CC         27 TIM1 Capture Compare */
     #endif
  #elif defined(STM32F100X4_X6) || defined(STM32F100X8_XB) || \
        defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE)
     #if ZOTTAOS_TIMER == OS_IO_TIM15
        _OSTimerHandler, /* OS_IO_TIM1_BRK_TIM15 24 TIM1 Break and TIM15 */
     #else
        _OSIOHandler, /* OS_IO_TIM1_BRK_TIM15    24 TIM1 Break and TIM15 */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM1
        _OSTimerHandler_up, /* OS_IO_TIM1_UP_TIM16  25 TIM1 Update and TIM16 */
     #elif ZOTTAOS_TIMER == OS_IO_TIM16
        _OSTimerHandler, /* OS_IO_TIM1_UP_TIM16  25 TIM1 Update and TIM16 */
     #else
        _OSIOHandler, /* OS_IO_TIM1_UP_TIM16     25 TIM1 Update and TIM16 */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM17
        _OSTimerHandler, /* OS_IO_TIM1_TRG_COM_TIM17 26 TIM1 Trigger and Commutation and TIM17 */
     #else
        _OSIOHandler, /* OS_IO_TIM1_TRG_COM_TIM17    26 TIM1 Trigger and Commutation and TIM17 */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM1
        _OSTimerHandler_cc, /* OS_IO_TIM1_CC      27 TIM1 Capture Compare */
     #else
        _OSIOHandler, /* OS_IO_TIM1_CC         27 TIM1 Capture Compare */
     #endif
  #elif defined (STM32F101RF_RG)|| defined(STM32F101VF_VG_ZF_ZG)
     #if ZOTTAOS_TIMER == OS_IO_TIM9
        _OSTimerHandler, /* OS_IO_TIM9 24 TIM9 global */
     #else
        _OSIOHandler, /* OS_IO_TIM9    24 TIM9 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM10
        _OSTimerHandler, /* OS_IO_TIM10 25 TIM10 global */
     #else
        _OSIOHandler, /* OS_IO__TIM10    25 TIM10 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM11
        _OSTimerHandler, /* OS_IO_TIM11 26 TIM11*/
     #else
        _OSIOHandler, /* OS_IO_TIM11    26 TIM11 */
     #endif
     #if defined(DEBUG_MODE)
        UndefinedInterrupt,
     #else
        NULL,
     #endif
  #elif defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
     #if ZOTTAOS_TIMER == OS_IO_TIM9
        _OSTimerHandler, /* OS_IO_TIM1_BRK_TIM9 24 TIM1 Break  and TIM9 global */
     #else
        _OSIOHandler, /* OS_IO_TIM1_BRK_TIM9    24 TIM1 Break  and TIM9 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM1
        _OSTimerHandler_up, /* OS_IO_TIM1_UP_TIM10 25 TIM1 Update and TIM10 global */
     #elif ZOTTAOS_TIMER == OS_IO_TIM10
        _OSTimerHandler, /* OS_IO_TIM1_UP_TIM10 25 TIM1 Update and TIM10 global */
     #else
        _OSIOHandler, /* OS_IO_TIM1_UP_TIM10    25 TIM1 Update and TIM10 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM11
        _OSTimerHandler, /* OS_IO_TIM1_TRG_COM_TIM11 26 TIM1 Trigger and Commutation  and TIM11*/
     #else
        _OSIOHandler, /* OS_IO_TIM1_TRG_COM_TIM11    26 TIM1 Trigger and Commutation  and TIM11 */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM1
        _OSTimerHandler, /* OS_IO_TIM1_CC       27 TIM1 Capture Compare */
     #else
        _OSIOHandler, /* OS_IO_TIM1_CC          27 TIM1 Capture Compare */
     #endif
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
     NULL,
     NULL,
  #endif
  #if ZOTTAOS_TIMER == OS_IO_TIM2
     _OSTimerHandler, /* OS_IO_TIM2            28  TIM2 global */
  #else
     _OSIOHandler, /* OS_IO_TIM2               28  TIM2 global */
  #endif
  #if ZOTTAOS_TIMER == OS_IO_TIM3
     _OSTimerHandler, /* OS_IO_TIM3            29  TIM3 global */
  #else
     _OSIOHandler, /* OS_IO_TIM3               29  TIM3 global */
  #endif
  #if defined (STM32F100X8_XB) || defined (STM32F100RC_RD_RE) || \
      defined (STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101T8_TB) || \
      defined(STM32F101C8_CB_R8_RB_V8_VB) || defined(STM32F101RC_RD_RE) || \
      defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || defined(STM32F102X8_XB) || \
      defined(STM32F103T8_TB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined (STM32F101RF_RG)|| defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     #if ZOTTAOS_TIMER == OS_IO_TIM4
        _OSTimerHandler, /* OS_IO_TIM4         30 TIM4 global */
     #else
        _OSIOHandler, /* OS_IO_TIM4            30 TIM4 global */
     #endif
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_I2C1_EV               31 I2C1 Event */
  _OSIOHandler, /* OS_IO_I2C1_ER               32 I2C1 Error */
  #if defined(STM32F100X8_XB) || defined(STM32F100RC_RD_RE) || \
      defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_I2C2_EV            33 I2C2 Event */
     _OSIOHandler, /* OS_IO_I2C2_ER            34 I2C2 Error */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_SPI1                  35 SPI1 global */
  #if defined(STM32F100X8_XB) || defined(STM32F100RC_RD_RE) || \
      defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_SPI2               36 SPI2 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_USART1                37 USART1 global */
  _OSIOHandler, /* OS_IO_USART2                38 USART2 global */
  #if defined(STM32F100X8_XB) || defined(STM32F100RC_RD_RE) || \
      defined(STM32F100VC_VD_VE_ZC_ZD_ZE) || defined(STM32F101C8_CB_R8_RB_V8_VB) || \
      defined(STM32F101RC_RD_RE) || defined(STM32F101VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
      defined(STM32F102X8_XB) || defined(STM32F103C8_CB_R8_RB_V8_VB) || \
      defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
      defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG) || \
      defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_USART3             39 USART3 global */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  _OSIOHandler, /* OS_IO_EXTI15_10             40 External Line[15:10] */
  _OSIOHandler, /* OS_IO_RTCAlarm              41 RTC Alarm through EXTI Line */
  #if defined(STM32F103X4_X6) || defined(STM32F103T8_TB) || \
      defined(STM32F103C8_CB_R8_RB_V8_VB) || defined(STM32F103RC_RD_RE) || \
      defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || defined(STM32F103RF_RG) || \
      defined(STM32F103VF_VG_ZF_ZG) || defined(STM32F102X4_X6) || defined(STM32F102X8_XB)
     _OSIOHandler, /* OS_IO_USBWakeUp          42 USB Device WakeUp from suspend through
                                                  EXTI Line */
  #elif defined(STM32F100X4_X6) || defined(STM32F100X8_XB) || \
        defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE)
     _OSIOHandler, /* OS_IO_CEC                42 HDMI-CEC */
  #elif defined(STM32F105XX) || defined(STM32F107XX)
     _OSIOHandler, /* OS_IO_OTG_FS_WKUP        42 USB OTG FS WakeUp from suspend through
                                                  EXTI Line */
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
  #else
     NULL,
  #endif
  #if defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE)
     _OSIOHandler, /* OS_IO_TIM8_BRK           43 TIM8 Break */
     #if ZOTTAOS_TIMER == OS_IO_TIM8
        _OSTimerHandler_up, /* OS_IO_TIM8_UP      44 TIM8 Update */
     #else
        _OSIOHandler, /* OS_IO_TIM8_UP         44 TIM8 Update */
     #endif
     _OSIOHandler, /* OS_IO_TIM8_TRG_COM       45 TIM8 Trigger and Commutation */
     #if ZOTTAOS_TIMER == OS_IO_TIM8
        _OSTimerHandler_cc, /* OS_IO_TIM8_CC      46 TIM8 Capture Compare */
     #else
        _OSIOHandler, /* OS_IO_TIM8_CC         46 TIM8 Capture Compare */
     #endif
  #elif defined(STM32F101RF_RG) || defined(STM32F101VF_VG_ZF_ZG) || \
        defined(STM32F100RC_RD_RE) || defined(STM32F100VC_VD_VE_ZC_ZD_ZE )
     #if ZOTTAOS_TIMER == OS_IO_TIM12
        _OSTimerHandler, /* OS_IO_TIM12        43 TIM12 global */
     #else
        _OSIOHandler, /* OS_IO_TIM12           43 TIM12 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM13
        _OSTimerHandler, /* OS_IO_TIM13        44 TIM13 global */
     #else
        _OSIOHandler, /* OS_IO_TIM13           44 TIM13 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM14
        _OSTimerHandler, /* OS_IO_TIM14        45 TIM14 global */
     #else
        _OSIOHandler, /* OS_IO_TIM14           45 TIM14 global */
     #endif
     #if defined(DEBUG_MODE)
        UndefinedInterrupt,
     #else
        NULL,
     #endif
  #elif defined(STM32F103RF_RG) || defined(STM32F103VF_VG_ZF_ZG)
     #if ZOTTAOS_TIMER == OS_IO_TIM12
        _OSTimerHandler, /* OS_IO_TIM8_BRK_TIM12  43 TIM8 Break and TIM12 global */
     #else
        _OSIOHandler, /* OS_IO_TIM8_BRK_TIM12     43 TIM8 Break and TIM12 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM8
        _OSTimerHandler_up, /* OS_IO_TIM8_UP_TIM13   44 TIM8 Update and TIM13 global */
     #elif ZOTTAOS_TIMER == OS_IO_TIM13
        _OSTimerHandler, /* OS_IO_TIM8_UP_TIM13   44 TIM8 Update and TIM13 global */
     #else
        _OSIOHandler, /* OS_IO_TIM8_UP_TIM13      44 TIM8 Update and TIM13 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM14
        _OSTimerHandler, /* OS_IO_TIM8_TRG_COM_TIM14 45 TIM8 Trigger and Commutation  and TIM14 global */
     #else
        _OSIOHandler, /* OS_IO_TIM8_TRG_COM_TIM14    45 TIM8 Trigger and Commutation  and TIM14 global */
     #endif
     #if ZOTTAOS_TIMER == OS_IO_TIM8
        _OSTimerHandler_cc, /* OS_IO_TIM8_CC         46 TIM8 Capture Compare */
     #else
        _OSIOHandler, /* OS_IO_TIM8_CC            46 TIM8 Capture Compare */
     #endif
  #elif defined(DEBUG_MODE)
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
     UndefinedInterrupt,
  #else
     NULL,
     NULL,
     NULL,
     NULL,
  #endif
  #if defined(STM32F103RC_RD_RE) || defined(STM32F103VC_VD_VE_ZC_ZD_ZE) || \
